[
    {
      "company": "WebstaurantStore",
      "title": "Junior Software Engineer",
      "date": "May 2024 - Aug 2024",
      "description": [
        "Developed a new ASP.NET service in C# to intercept and suppress redundant alerts, reducing operational costs by 90% and eliminating over 50,000 weekly Sentry alerts, resulting in substantial savings under the pay-per-alert model.",
        "Created an optimized SQL procedure to retrieve 1,000,000+ customer shipping reports with integrated filtering, reducing load times by 5%, integrating with a dynamic frontend using Blazor and Kendo UI for enhanced data visualization.",
        "Modified MediatR API endpoints to incorporate filtering during SQL data retrieval, resulting in a 10% reduction in load times and doubling publicly accessible warehouse data."
      ],
      "image": "/experience/webstaurant-store.png"
    },
    {
        "company": "Grid Protection Alliance",
        "title": "Software Engineering Intern",
        "date": "May 2023 - May 2024",
        "description": [
            "Spearheaded a new Grafana data source plugin using React and TypeScript to simultaneously process over 750,000 phasor data points and created 30+ custom functions for advanced analysis and faulty phasor detection.",
            "Developed a backend in C# with .NET RESTful API calls to retrieve data from multiple SQL tables, enabling on-retrieval function modification and reducing data analysis wait times by 15%.",
            "Worked part-time during school to fix bugs and manage issues using Jira."
        ],
        "image": "/experience/gridprotectionalliance.jpg"
      },
    {
      "company": "RCOS",
      "title": "Coordinator",
      "date": "Aug 2024 - Present",
      "description": [
        "Leading a group of 480 students spanning 120+ different open source projects with a team of 5 other student coordinators.",
        "Work closely with a room of 30 students, guiding project leads on project planning and conducting daily stand-ups",
        "Playing a key role in scaling the program, contributing to a steady 10% sign up growth every year."
      ],
      "image": "/experience/rcos.png"
    }
]
  