[
  {
    "company": "Datadog",
    "title": "Software Engineering Intern",
    "date": "June 2025 - Aug 2025",
    "summary": "At Datadog, I worked on the OpenTelemetry Agent team (DDOT), scaling observability infrastructure and building automation. I also competed in the company-wide hackathon where our project won 1st place.",
    "bullets": [
      "Won 1st place out of 500+ teams by building Workflow Automation auto-suggestions and fine-tuning an OpenAI model on 70K+ points, cutting runtime by 90% (3–5s vs 40s).",
      "Enabled Linux bare-metal support for Datadog OpenTelemetry Collector (DDOT) by adding OCI packaging and installer builds, reaching 5K+ new hosts and reducing setup from 20+ minutes to a one-click install.",
      "Integrated remote configuration into DDOT, enabling distributed concurrent updates to 1,000+ agents in under 5 minutes."
    ],
    "image": "/experience/datadog.png"
  },
  {
    "company": "WebstaurantStore",
    "title": "Software Engineering Intern",
    "date": "May 2024 - Aug 2024",
    "summary": "I focused on backend and frontend optimizations, reducing operational costs and improving system performance for warehouse reporting and alerting systems.",
    "bullets": [
      "Reduced alerting costs by 90%+ by eliminating 50K+ redundant weekly Sentry logs with a C# ASP.NET service.",
      "Improved SQL query performance on 1M+ shipping reports by ~500ms per query (10%) with pre-filtering logic.",
      "Refactored MediatR API endpoints to support dynamic filtering and improve Blazor/Kendo UI data pipelines."
    ],
    "image": "/experience/webstaurant-store.png"
  },
  {
    "company": "Grid Protection Alliance",
    "title": "Software Engineering Intern",
    "date": "May 2023 - May 2024",
    "summary": "I contributed to power grid monitoring software by building high-performance data visualization tools and backend systems. While working part-time during school, I helped enhance analysis speed and reliability for phasor measurement data used across the U.S. electric grid.",
    "bullets": [
      "Built a Grafana data source plugin with React and TypeScript to visualize over 750,000 phasor data points, including 30+ custom functions for advanced analysis and fault detection.",
      "Developed a backend in C# with .NET RESTful API calls to retrieve data from multiple SQL tables, enabling on-retrieval function modification and reducing data analysis latency by 15%.",
      "Maintained production systems by fixing bugs and managing issues in Jira while balancing a part-time workload during school."
    ],
    "image": "/experience/gridprotectionalliance.jpg"
  }
]
